Revit 2024 API
MassLevelData.OwningMassId Property
 The ElementId of the mass that the MassLevelData (Mass Floor) is associated with.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public ElementId OwningMassId { get; }
Visual Basic
Public ReadOnly Property OwningMassId As ElementId
	Get
Visual C++
public:
property ElementId^ OwningMassId {
	ElementId^ get ();
}
See Also
MassLevelData Class
Autodesk.Revit.DB.Analysis Namespace